["Equity release products shall be lifetime products. The customers shall be able to live in their main homes for their whole life to enjoy and maintain.", "If the customer is residing on the property and upholding its contractual obligations, the provider (which term henceforth in this document includes any creditor to which the loan is subsequently transferred) has the right to require repayment of the outstanding loan, rolled up interest and costs due, only upon the customer’s death or a move into permanent long-term care.","When an event occurs, which makes the loan due for repayment, the customer or the customer’s estate shall be given a reasonable time to arrange for the repayment, which includes time for estate inventory proceedings and/or sale of the property for the repayment of the amounts due with the proceeds. Unless the property is to be sold at a public auction, the provider shall have a contractual right to control that the property is professionally sold at market conditions."
,"If on the property’s sale on market conditions, the sales proceeds are lower than the amount due, and provided that the customer is not in breach of any substantial contractual obligations, the provider will not expect the customer or the customer’s estate or heirs to make up the shortfall with other assets. This commitment shall as a minimum be applied when the property is sold following the customer’s death or permanent move to long term care.","Providers should allow customers to transfer the loan to another suitable property, which meets the providers’ then lending conditions and criteria.","Early redemption of the loans should be permitted. Providers should at the outset make clear the likely cost impact to the customer for such redemption and ensure transparency of costs.","Product providers may offer a range of terms, including interest served, rolled up, fixed for life or a term, or variable. In case of variable interest customers should preferably be offered an option to have an interest rate cap and in any case be informed of the impact of not having such a cap.","In the pre-sales information pack, the impact of compounded interest shall be shown – in different interest rate scenarios if required – showing the growth of the total debt over time. A comparison between these calculations and the home-value development in different house price index scenarios shall also be included, showing estimated development of the customer’s net equity.","The providers are required to ensure that all information from the provider to customers and the contracting process are done by competent, knowledgeable and duly authorized persons.","The providers will require that a checklist has been completed before contract signing, showing that the customer has received the required relevant information. The checklist shall be signed by both the customer and the informer and a copy given to the provider and the customer."]